In [4]:
import pandas as pd 
df=pd.read_csv("C:\\task1\\Employee_Dataset.csv")
df

,employee_id,department,designation,age,salary,joining_date,last_promotion_date,experience_years,performance_rating,is_active
0,EMP1000,IT,Senior Analyst,60,85000,invalid,01/04/2021,5,3,NaN
1,emp_1,IT,Analyst,NaN,55000,10/06/2020,invalid,5,3,True
2,EMP1002,Sales,NaN,28,85000,NaN,2022-03-01,3,4,NaN
3,EMP1003,it,Analyst,45,35000,invalid,01/04/2021,1,3,NaN
4,NaN,IT,mgr,150,85000,NaN,invalid,12,2,True
...,...,...,...,...,...,...,...,...,...,...
995,EMP1995,Finance,NaN,60,55000,2019-05-10,2022-03-01,1,4,yes
996,EMP1996,IT,Analyst,35,250000,invalid,invalid,-2,5,NaN
997,EMP1997,Sales,Senior Analyst,150,250000,2021/07/15,invalid,3,excellent,yes
998,emp_998,Finance,NaN,60,85000,2019-05-10,NaN,12,NaN,True
999,EMP1999,it,Manager,150,₹75000,invalid,2022-03-01,ten,5,yes

In [5]:
# Convert joining_date to datetime and count how many rows failed conversion.
df['joining_date'] = pd.to_datetime(df['joining_date'], errors='coerce')
failed_conversions = df['joining_date'].isna().sum()
print(f"Number of rows that failed conversion: {failed_conversions}")

Number of rows that failed conversion: 377

C:\Users\ASUS\AppData\Local\Temp\ipykernel_13744\3181746004.py:2: UserWarning: Could not infer format, so each element will be parsed individually, falling back to `dateutil`. To ensure parsing is consistent and as-expected, please specify a format.
  df['joining_date'] = pd.to_datetime(df['joining_date'], errors='coerce')

In [ ]:
#Clean employee_id and identify how many duplicate employees exist after standardization.
df['employee_id'] = df['employee_id'].str.strip().str.upper()
duplicate_employees = df.duplicated(subset=['employee_id']).sum()
print(f"Number of duplicate employees: {duplicate_employees}")